dropletCoalescence/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       101920;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       102080;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       102240;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          51200;
        startFace       102560;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          51200;
        startFace       153760;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       204960;
    }
)

// ************************************************************************* //
